# 28th March

In [22]:
import pandas as pd

In [23]:
data_frame=pd.DataFrame()

In [24]:
data_frame

Empty DataFrame
Columns: []
Index: []

In [25]:
type(data_frame)

pandas.core.frame.DataFrame

List
dict
series
numpy array

In [27]:
data=[1,2,3,4,5]

In [28]:
pd.DataFrame(data)

   0
0  1
1  2
2  3
3  4
4  5

In [29]:
data2=[['santosh',26],['manish',28],['priya',25]]

In [30]:
pd.DataFrame(data2)

         0   1
0  santosh  26
1   manish  28
2    priya  25

In [31]:
pd.DataFrame(data2,columns=['Name','Age'])

      Name  Age
0  santosh   26
1   manish   28
2    priya   25

In [32]:
data3={'Name':['Satish','Nishant','Ashish'],'Age':[25,26,27]}

In [33]:
pd.DataFrame(data3)

      Name  Age
0   Satish   25
1  Nishant   26
2   Ashish   27

In [34]:
data4=[{'Santosh':26,'Amit':30},{'Santosh':31,'Amit':35,'Rahul':35}]

In [35]:
pd.DataFrame(data4)

   Santosh  Amit  Rahul
0       26    30    NaN
1       31    35   35.0

In [36]:
pd.DataFrame(data4,index=['first','second'])

        Santosh  Amit  Rahul
first        26    30    NaN
second       31    35   35.0

In [52]:
pd.read_csv(r"C:\Users\santo\Downloads\test.csv")

      Name  Age     Designation Salary
0  Santosh   26  Data Scientist    30k
1   Manish   25  ML Engineering    25k
2     Abhi   31   Data Engineer    45k
3  Shreaya   29  Cloud Engineer    41k

In [38]:
pd.read_csv(r"C:\Users\santo\Downloads\test - Sheet1.tsv")

     Name\tAge\tDesignation\tSalary
0  Santosh\t26\tData Scientist\t30k
1   Manish\t25\tML Engineering\t25k
2      Abhi\t31\tData Engineer\t45k
3  Shreaya\t29\tCloud Engineer\t41k

In [39]:
pd.read_csv(r"C:\Users\santo\Downloads\test - Sheet1.tsv",sep='\t')

      Name  Age     Designation Salary
0  Santosh   26  Data Scientist    30k
1   Manish   25  ML Engineering    25k
2     Abhi   31   Data Engineer    45k
3  Shreaya   29  Cloud Engineer    41k

In [40]:
data = '''{
    "name": "santosh kumar",
    "phone_no": 8249289699,
    "company_name": ["xyz", "abc", "123"]
}'''

In [41]:
import json

In [42]:
d=json.loads(data) # JSON (JavaScript Object Notation) requires that string values be enclosed in double quotes ("...").

In [43]:
d

{'name': 'santosh kumar',
 'phone_no': 8249289699,
 'company_name': ['xyz', 'abc', '123']}

In [44]:
type(d)

dict

In [45]:
pd.DataFrame(d)

            name    phone_no company_name
0  santosh kumar  8249289699          xyz
1  santosh kumar  8249289699          abc
2  santosh kumar  8249289699          123

In [ ]:
# first convert data into raw in github

In [49]:
pd.read_csv('https://raw.githubusercontent.com/sunnysavita10/Statistics-With-Python-TheCompleteGuide/main/googleplaystore.csv')

,App,Category,Rating,Reviews,Size,Installs,Type,Price,Content Rating,Genres,Last Updated,Current Ver,Android Ver
0,Photo Editor & Candy Camera & Grid & ScrapBook,ART_AND_DESIGN,4.1,159,19M,"10,000+",Free,0,Everyone,Art & Design,"January 7, 2018",1.0.0,4.0.3 and up
1,Coloring book moana,ART_AND_DESIGN,3.9,967,14M,"500,000+",Free,0,Everyone,Art & Design;Pretend Play,"January 15, 2018",2.0.0,4.0.3 and up
2,"U Launcher Lite – FREE Live Cool Themes, Hide ...",ART_AND_DESIGN,4.7,87510,8.7M,"5,000,000+",Free,0,Everyone,Art & Design,"August 1, 2018",1.2.4,4.0.3 and up
3,Sketch - Draw & Paint,ART_AND_DESIGN,4.5,215644,25M,"50,000,000+",Free,0,Teen,Art & Design,"June 8, 2018",Varies with device,4.2 and up
4,Pixel Draw - Number Art Coloring Book,ART_AND_DESIGN,4.3,967,2.8M,"100,000+",Free,0,Everyone,Art & Design;Creativity,"June 20, 2018",1.1,4.4 and up
...,...,...,...,...,...,...,...,...,...,...,...,...,...
10836,Sya9a Maroc - FR,FAMILY,4.5,38,53M,"5,000+",Free,0,Everyone,Education,"July 25, 2017",1.48,4.1 and up
10837,Fr. Mike Schmitz Audio Teachings,FAMILY,5.0,4,3.6M,100+,Free,0,Everyone,Education,"July 6, 2018",1.0,4.1 and up
10838,Parkinson Exercices FR,MEDICAL,NaN,3,9.5M,"1,000+",Free,0,Everyone,Medical,"January 20, 2017",1.0,2.2 and up
10839,The SCP Foundation DB fr nn5n,BOOKS_AND_REFERENCE,4.5,114,Varies with device,"1,000+",Free,0,Mature 17+,Books & Reference,"January 19, 2015",Varies with device,Varies with device
10840,iHoroscope - 2018 Daily Horoscope & Astrology,LIFESTYLE,4.5,398307,19M,"10,000,000+",Free,0,Everyone,Lifestyle,"July 25, 2018",Varies with device,Varies with device

In [50]:
pd.read_html("https://www.pro-football-reference.com/years/2020/")

[                      Tm          W          L          T       W-L%  \
 0               AFC East   AFC East   AFC East   AFC East   AFC East
 1         Buffalo Bills*         13          3          0       .813
 2         Miami Dolphins         10          6          0       .625
 3   New England Patriots          7          9          0       .438
 4          New York Jets          2         14          0       .125
 5              AFC North  AFC North  AFC North  AFC North  AFC North
 6   Pittsburgh Steelers*         12          4          0       .750
 7      Baltimore Ravens+         11          5          0       .688
 8      Cleveland Browns+         11          5          0       .688
 9     Cincinnati Bengals          4         11          1       .281
 10             AFC South  AFC South  AFC South  AFC South  AFC South
 11     Tennessee Titans*         11          5          0       .688
 12   Indianapolis Colts+         11          5          0       .688
 13        Houston Texans          4         12          0       .250
 14  Jacksonville Jaguars          1         15          0       .063
 15              AFC West   AFC West   AFC West   AFC West   AFC West
 16   Kansas City Chiefs*         14          2          0       .875
 17     Las Vegas Raiders          8          8          0       .500
 18  Los Angeles Chargers          7          9          0       .438
 19        Denver Broncos          5         11          0       .313

            PF         PA         PD        MoV        SoS        SRS  \
 0    AFC East   AFC East   AFC East   AFC East   AFC East   AFC East
 1         501        375        126        7.9       -0.2        7.7
 2         404        338         66        4.1       -1.2        3.0
 3         326        353        -27       -1.7        0.7       -1.0
 4         243        457       -214      -13.4        1.9      -11.5
 5   AFC North  AFC North  AFC North  AFC North  AFC North  AFC North
 6         416        312        104        6.5       -1.8        4.7
 7         468        303        165       10.3       -2.0        8.3
 8         408        419        -11       -0.7       -1.9       -2.6
 9         311        424       -113       -7.1       -0.4       -7.5
 10  AFC South  AFC South  AFC South  AFC South  AFC South  AFC South
 11        491        439         52        3.3       -1.7        1.6
 12        451        362         89        5.6       -2.8        2.8
 13        384        464        -80       -5.0       -0.5       -5.5
 14        306        492       -186      -11.6       -0.1      -11.7
 15   AFC West   AFC West   AFC West   AFC West   AFC West   AFC West
 16        473        362        111        6.9       -0.1        6.8
 17        434        478        -44       -2.8        0.8       -2.0
 18        384        426        -42       -2.6       -0.3       -2.9
 19        323        446       -123       -7.7        1.7       -6.0

          OSRS       DSRS
 0    AFC East   AFC East
 1         7.1        0.6
 2         0.3        2.7
 3        -4.2        3.2
 4        -8.7       -2.8
 5   AFC North  AFC North
 6         0.3        4.4
 7         3.9        4.3
 8         0.3       -2.8
 9        -5.4       -2.1
 10  AFC South  AFC South
 11        4.7       -3.1
 12        1.2        1.6
 13       -1.4       -4.1
 14       -6.5       -5.3
 15   AFC West   AFC West
 16        4.5        2.3
 17        2.9       -4.9
 18       -1.0       -2.0
 19       -4.3       -1.7  ,
                            Tm          W          L          T       W-L%  \
 0                    NFC East   NFC East   NFC East   NFC East   NFC East
 1   Washington Football Team*          7          9          0       .438
 2             New York Giants          6         10          0       .375
 3              Dallas Cowboys          6         10          0       .375
 4         Philadelphia Eagles          4         11          1       .281
 5                   NFC North  NFC North  NFC North  NFC North  NFC North
 6          Green Bay Packers*         13          3          0       .813
 7              Chicago Bears+          8          8          0       .500
 8           Minnesota Vikings          7          9          0       .438
 9               Detroit Lions          5         11          0       .313
 10                  NFC South  NFC South  NFC South  NFC South  NFC South
 11        New Orleans Saints*         12          4          0       .750
 12      Tampa Bay Buccaneers+         11          5          0       .688
 13          Carolina Panthers          5         11          0       .313
 14            Atlanta Falcons          4         12          0       .250
 15                   NFC West   NFC West   NFC West   NFC West   NFC West
 16          Seattle Seahawks*         12          4          0       .750
 17          Los Angeles Rams+         10          6          0       .625
 18          Arizona Cardinals          8          8          0       .500
 19        San Francisco 49ers          6         10          0       .375

            PF         PA         PD        MoV        SoS        SRS  \
 0    NFC East   NFC East   NFC East   NFC East   NFC East   NFC East
 1         335        329          6        0.4       -1.2       -0.8
 2         280        357        -77       -4.8        0.4       -4.4
 3         395        473        -78       -4.9       -0.2       -5.1
 4         334        418        -84       -5.3        0.8       -4.4
 5   NFC North  NFC North  NFC North  NFC North  NFC North  NFC North
 6         509        369        140        8.8       -1.1        7.7
 7         372        370          2        0.1        0.1        0.2
 8         430        475        -45       -2.8        0.4       -2.4
 9         377        519       -142       -8.9        1.2       -7.7
 10  NFC South  NFC South  NFC South  NFC South  NFC South  NFC South
 11        482        337        145        9.1        0.5        9.6
 12        492        355        137        8.6        0.8        9.4
 13        350        402        -52       -3.3        2.2       -1.1
 14        396        414        -18       -1.1        1.9        0.7
 15   NFC West   NFC West   NFC West   NFC West   NFC West   NFC West
 16        459        371         88        5.5        0.0        5.5
 17        372        296         76        4.8        0.7        5.4
 18        410        367         43        2.7       -0.1        2.6
 19        376        390        -14       -0.9        1.7        0.8

          OSRS       DSRS
 0    NFC East   NFC East
 1        -4.1        3.2
 2        -6.7        2.3
 3         1.0       -6.1
 4        -2.8       -1.6
 5   NFC North  NFC North
 6         5.9        1.8
 7        -2.2        2.4
 8         1.3       -3.8
 9        -1.0       -6.7
 10  NFC South  NFC South
 11        5.1        4.5
 12        6.5        2.8
 13       -2.4        1.3
 14       -0.1        0.8
 15   NFC West   NFC West
 16        4.8        0.7
 17       -0.8        6.2
 18        1.5        1.0
 19        0.2        0.7  ]

In [51]:
data

AttributeError: 'str' object has no attribute 'shape'

In [53]:
data=pd.read_csv(r"C:\Users\santo\Downloads\test.csv")

In [54]:
data

      Name  Age     Designation Salary
0  Santosh   26  Data Scientist    30k
1   Manish   25  ML Engineering    25k
2     Abhi   31   Data Engineer    45k
3  Shreaya   29  Cloud Engineer    41k

In [55]:
data.shape

(4, 4)

In [56]:
data.dtypes

Name           object
Age             int64
Designation    object
Salary         object
dtype: object

In [57]:
data.head(2)

      Name  Age     Designation Salary
0  Santosh   26  Data Scientist    30k
1   Manish   25  ML Engineering    25k

In [58]:
data.tail(2)

      Name  Age     Designation Salary
2     Abhi   31   Data Engineer    45k
3  Shreaya   29  Cloud Engineer    41k

In [66]:
data.sample(n=2)  # getting a random sample

     Name  Age     Designation Salary
1  Manish   25  ML Engineering    25k
2    Abhi   31   Data Engineer    45k

In [67]:
data.values

array([['Santosh', 26, 'Data Scientist', '30k'],
       ['Manish', 25, 'ML Engineering', '25k'],
       ['Abhi', 31, 'Data Engineer', '45k'],
       ['Shreaya', 29, 'Cloud Engineer', '41k']], dtype=object)

In [68]:
data.size

16

In [69]:
data.ndim

2

In [70]:
data.axes

[RangeIndex(start=0, stop=4, step=1),
 Index(['Name', 'Age', 'Designation', 'Salary'], dtype='object')]

In [72]:
data.T  # transpose of data

                          0               1              2               3
Name                Santosh          Manish           Abhi         Shreaya
Age                      26              25             31              29
Designation  Data Scientist  ML Engineering  Data Engineer  Cloud Engineer
Salary                  30k             25k            45k             41k

In [73]:
data.empty

False

In [74]:
pd.DataFrame().empty

True

In [76]:
import numpy as np
np.random.randn(5,3)

array([[ 0.53081768,  0.24217136,  0.68539673],
       [ 0.09400109,  1.8117976 ,  0.79011763],
       [-0.62129556, -1.05910874, -1.04657044],
       [ 0.15242922,  0.91110803, -0.66480286],
       [ 1.49757166,  0.68418409, -1.4721796 ]])

In [79]:
dataframe=pd.DataFrame(np.random.randn(5,3),columns=['col1','col2','col3'])

In [95]:
dataframe

       col1      col2      col3
0 -0.934266 -0.234132 -1.405218
1 -0.169042  0.907274  0.101107
2  0.422734  0.673800  1.385654
3  0.764927 -1.309138  0.371527
4 -1.276492  0.511644  1.165835

In [81]:
dataframe.apply(np.mean)

col1   -0.238428
col2    0.109890
col3    0.323781
dtype: float64

In [82]:
dataframe.apply(np.median)

col1   -0.169042
col2    0.511644
col3    0.371527
dtype: float64

In [83]:
dataframe.apply(lambda x: x.max())

col1    0.764927
col2    0.907274
col3    1.385654
dtype: float64

In [85]:
dataframe.apply(lambda x: x.min())

col1   -1.276492
col2   -1.309138
col3   -1.405218
dtype: float64

In [84]:
dataframe.apply(lambda x: x.max()-x.min())

col1    2.041418
col2    2.216412
col3    2.790872
dtype: float64

In [86]:
dataframe['col1']

0   -0.934266
1   -0.169042
2    0.422734
3    0.764927
4   -1.276492
Name: col1, dtype: float64

In [87]:
dataframe['col1'].apply(lambda x: x+1)

0    0.065734
1    0.830958
2    1.422734
3    1.764927
4   -0.276492
Name: col1, dtype: float64

In [90]:
df=dataframe['col1'].map(lambda x: x*100)

In [92]:
df

0    -93.426634
1    -16.904151
2     42.273353
3     76.492668
4   -127.649180
Name: col1, dtype: float64

In [91]:
df.apply(np.mean)

0    -93.426634
1    -16.904151
2     42.273353
3     76.492668
4   -127.649180
Name: col1, dtype: float64

In [93]:
data.reindex(index=["a","b","c","d","e","f","g"])

  Name  Age Designation Salary
a  NaN  NaN         NaN    NaN
b  NaN  NaN         NaN    NaN
c  NaN  NaN         NaN    NaN
d  NaN  NaN         NaN    NaN
e  NaN  NaN         NaN    NaN
f  NaN  NaN         NaN    NaN
g  NaN  NaN         NaN    NaN

In [97]:
dataframe.rename(columns={"col1":"c1"})

         c1      col2      col3
0 -0.934266 -0.234132 -1.405218
1 -0.169042  0.907274  0.101107
2  0.422734  0.673800  1.385654
3  0.764927 -1.309138  0.371527
4 -1.276492  0.511644  1.165835

In [98]:
dataframe.rename(columns={"col1":"c1"},index={0:"row1"})

            c1      col2      col3
row1 -0.934266 -0.234132 -1.405218
1    -0.169042  0.907274  0.101107
2     0.422734  0.673800  1.385654
3     0.764927 -1.309138  0.371527
4    -1.276492  0.511644  1.165835

In [99]:
for i in dataframe.iteritems():
    print(i)

('col1', 0   -0.934266
1   -0.169042
2    0.422734
3    0.764927
4   -1.276492
Name: col1, dtype: float64)
('col2', 0   -0.234132
1    0.907274
2    0.673800
3   -1.309138
4    0.511644
Name: col2, dtype: float64)
('col3', 0   -1.405218
1    0.101107
2    1.385654
3    0.371527
4    1.165835
Name: col3, dtype: float64)

In [100]:
for i in dataframe.iterrows():
    print(i)

(0, col1   -0.934266
col2   -0.234132
col3   -1.405218
Name: 0, dtype: float64)
(1, col1   -0.169042
col2    0.907274
col3    0.101107
Name: 1, dtype: float64)
(2, col1    0.422734
col2    0.673800
col3    1.385654
Name: 2, dtype: float64)
(3, col1    0.764927
col2   -1.309138
col3    0.371527
Name: 3, dtype: float64)
(4, col1   -1.276492
col2    0.511644
col3    1.165835
Name: 4, dtype: float64)

In [101]:
for i in dataframe.itertuples():
    print(i)

Pandas(Index=0, col1=-0.9342663354260384, col2=-0.23413201124878272, col3=-1.405218139722961)
Pandas(Index=1, col1=-0.16904151212862542, col2=0.907273834045499, col3=0.10110748295627292)
Pandas(Index=2, col1=0.4227335312214355, col2=0.673799544996839, col3=1.3856539689348586)
Pandas(Index=3, col1=0.764926679759648, col2=-1.30913787966557, col3=0.3715270708112776)
Pandas(Index=4, col1=-1.2764917989940077, col2=0.511644174778413, col3=1.1658350087720069)

In [104]:
dataframe.sort_values(by=["col1","col2"])

       col1      col2      col3
4 -1.276492  0.511644  1.165835
0 -0.934266 -0.234132 -1.405218
1 -0.169042  0.907274  0.101107
2  0.422734  0.673800  1.385654
3  0.764927 -1.309138  0.371527